caseBackup/0/U.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

UMean 1.668;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    // #includeEtc "caseDicts/setConstraintTypes"

    BTM
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

    TOP
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }

    WALL1
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }

    WALL2
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }
    WALL3
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }
    WALL4
    {
        type pressureInletOutletVelocity;
        value uniform (0 0 0);
    }
}


// ************************************************************************* //
