caseBackup/0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    // #includeEtc "caseDicts/setConstraintTypes"

    WALL1
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    TOP
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    WALL4
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    WALL3
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    WALL2
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }
    BTM 
    {
        type            constantAlphaContactAngle;
        theta0          150;
        limit           gradient; 
        value           uniform 0;
    }
}

// ************************************************************************* //
