caseBackup/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.1;

boundaryField
{
    WALL2
    {
        type inletOutlet;
        inletValue uniform 0.1;
        value uniform 0.1;
    }
    WALL1
    {
        type inletOutlet;
        inletValue uniform 0.1;
        value uniform 0.1;
    }
    TOP
    {
        type inletOutlet;
        inletValue uniform 0.1;
        value uniform 0.1;
    }
    WALL3
    {
        type inletOutlet;
        inletValue uniform 0.1;
        value uniform 0.1;
    }
    BTM
    {
        type epsilonWallFunction;
        value uniform 0.1;
    }
    WALL4
    {
        type inletOutlet;
        inletValue uniform 0.1;
        value uniform 0.1
    }
}


// ************************************************************************* //
