caseBackup/0/k.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
    //- Set patchGroups for constraint patches
    // #includeEtc "caseDicts/setConstraintTypes"

    WALL2
    {
      type inletOutlet;
      inletValue uniform 0.01;
      value uniform 0.01;
    }

    WALL1
    {
      type inletOutlet;
      inletValue uniform 0.01;
      value uniform 0.01;
    }

    TOP
    {
      type inletOutlet;
      inletValue uniform 0.01;
      value uniform 0.01;
    }

    WALL3
    {
      type inletOutlet;
      inletValue uniform 0.01;
      value uniform 0.01;
    }

    WALL4
    {
      type inletOutlet;
      inletValue uniform 0.01;
      value uniform 0.01;
    }
    BTM
    {
      type kqRWallFunction;
      value uniform 0.01;

    }
}

// ************************************************************************* //
