caseBackup/0/nut.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //- Set patchGroups for constraint patches
    // #includeEtc "caseDicts/setConstraintTypes"

    WALL2
    {
         type calculated;
         value uniform 0;
    }

    WALL1
    {
         type calculated;
         value uniform 0;

    }

    TOP
    {
        type calculated;
        value uniform 0;
    }

    WALL3
    {
        type calculated;
        value uniform 0;
    }
    WALL4
    {
        type calculated;
        value uniform 0;
    }
    BTM
    {
        type nutkWallFunction;
        value uniform 0;
    }
}


// ************************************************************************* //
