caseBackup/0/p_rgh.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1.01e05;

boundaryField
{
    //- Set patchGroups for constraint patches
    // #includeEtc "caseDicts/setConstraintTypes"

    WALL2
    {
         type totalPressure;
         p0 uniform 1.01e05;
         U U;
         phi phi;
         rho rho;
         psi none;
         gamma 1;
         value uniform 1.01e05;
    }

    WALL1
    {
         type totalPressure;
         p0 uniform 1.01e05;
         U U;
         phi phi;
         rho rho;
         psi none;
         gamma 1;
         value uniform 1.01e05;
    }

    TOP
    {
         type totalPressure;
         p0 uniform 1.01e05;
         U U;
         phi phi;
         rho rho;
         psi none;
         gamma 1;
         value uniform 1.01e05;
    }

    WALL3
    {
         type totalPressure;
         p0 uniform 1.01e05;
         U U;
         phi phi;
         rho rho;
         psi none;
         gamma 1;
         value uniform 1.01e05;
    }
    WALL4
    {
        type totalPressure;
        p0 uniform 1.01e05;
        U U;
        phi phi;
        rho rho;
        psi none;
        gamma 1;
        value uniform 1.01e05;  
    }
    BTM
    {
        type fixedFluxPressure;
        value uniform 1.01e05;    
    }
}

// ************************************************************************* //
