caseBackup/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    BTM
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          625;
        startFace       26750;
    }
    TOP
    {
        type            patch;
        nFaces          625;
        startFace       27375;
    }
    WALL1
    {
        type            patch;
        nFaces          375;
        startFace       28000;
    }
    WALL2
    {
        type            patch;
        nFaces          375;
        startFace       28375;
    }
    WALL3
    {
        type            patch;
        nFaces          375;
        startFace       28750;
    }
    WALL4
    {
        type            patch;
        nFaces          375;
        startFace       29125;
    }
)

// ************************************************************************* //
