caseBackup/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (10 -10 0)
    (10 10 0)
    (-10 10 0)
    (-10 -10 0)
    (10 -10 12)
    (10 10 12)
    (-10 10 12)
    (-10 -10 12)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 25 15) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    BTM
     {
        type wall;
        faces
        (
            (0 1 2 3)
        );
     }
     TOP
     {
         type patch;
         faces
         (
            (4 5 6 7)
         );
     }
    WALL1
     {
         type patch;
         faces
         (
            (0 3 7 4)
         );
     }
     WALL2
     {
         type patch;
         faces
         (
            (3 2 6 7)
         );
     }
     WALL3
     {
         type patch;
         faces
         (
            (1 2 6 5)
         );
     }
     WALL4
     {
         type patch;
         faces
         (
            (0 1 5 4)
         );
     }
);

mergePatchPairs
(
);

// ************************************************************************* //
